#Вычислить число c заданной точностью d
from math import pi
d=int(input('Введите точность числа Пи '))
print (round(pi , d))