#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
my_list = [2, 3, 5, 9, 4]
print(sum(my_list[1::2]))